/**
 * @file NvmConfig.h
 * 
 * @brief       NvmConfig
 * @note        なし
 * 
 * @version     1.0.0
 * @date        2022/08/15
 * 
 * @copyright   (C) 2022 Motoyuki Endo
 */
#ifndef __NVMCONFIG_H
#define __NVMCONFIG_H

#include "SPIFFS.h"


//----------------------------------------------------------------
//  <macro>
//----------------------------------------------------------------


//----------------------------------------------------------------
//  <enum>
//----------------------------------------------------------------


//----------------------------------------------------------------
//  <struct>
//----------------------------------------------------------------


//----------------------------------------------------------------
//  <class>
//----------------------------------------------------------------
/**
 * @brief       NvmConfig
 * @note        なし
 */
class NvmConfig
{
private:
	void ReadConfig( void );                                       // コンフィグ読み出し

public:
	String ssid;
	String pass;
	String rosAgentIp;
	String rosAgentPort;

	NvmConfig( void );                                             // コンストラクタ
	~NvmConfig( void );                                            // デストラクタ
};

#endif
